Revit 2024 API
ParameterTypeId.StairstypeShowCutline Property
 "Show Cut Line in Plan": Show Cut Line in Plan
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairstypeShowCutline { get; }
Visual Basic
Public Shared ReadOnly Property StairstypeShowCutline As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairstypeShowCutline {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace